{
    "title": "AdaJS by BarcelonaJS",
    "menuEvents": "Esdeveniments",
    "menuAboutUs": "Nosaltres",
    "menuContact": "Contacte",
    "introPart1": "és una comunitat de dones que es reuneixen periòdicament a Barcelona, amb l'objectiu de promoure i recolzar el creixement del sector femení a l'àmbit de les tecnologíes de la informació (IT) mitjançant <strong>JavaScript</strong> i el desenvolupament web en general.<br>Per això el nostre caràcter és eminentment pràctic i educatiu.",
    "introPart2": "Què fem? Organitzem trobades i tallers gratuïts en els quals oferim a les nostres membres formació en tècniques de desevolupament web i <strong>JavaScript</strong>.",
    "introPart3": "No existeix cap mena de prerrequisit per entrar a formar part d'aquest grup, tant sols has de tenir ganes d'aprendre i de participar!",
    "titleContact": "Contacta amb nosaltres",
    "contactText": "Si tens qualsevol comentari, petició o proposta, no dubtis en posar-t'he en contacte amb nosaltres al email:",
    "aboutFounders": "Les fundadores",
    "aboutCurrent": "Membres en actiu",
    "titleUpcoming": "Propers esdeveniments",
    "titleSocial": "Xarxes socials",
    "titleBelongs": "és part de",
    "titleComingSoon": "Properament",
    "joinMeetup": "Apunta't al nostre Meetup",
    "titleEventDesc": "Descripció de l'esdeveniment",
    "events": [
        {
            "id": "ladiesjs",
            "title": "LadiesJS: Introducció al JavaScript",
            "desc": "",
            "completed": true
        },
        {
            "id": "jsforbeginners",
            "title": "Workshop: JavaScript per a principiants",
            "desc": "Sabies que el primer programador fou una dona? (Ada Lovelace, la nostra \"patrona\"). Sabies que la UE preveu que en 5 anys es creïn 900.000 llocs de treball relacionats amb les TIC? T'atreuen internet i la tecnologia? T'agradaria saber programar però creus que és molt difícil? En absolut! Aquest serà un taller pràctic de 3 hores en el qual t'ajudarem a aprendre, per tu mateixa i al teu ritme, els principis de la programació amb el llenguatge de moda: JavaScript.",
            "completed": true
        },
        {
            "id": "webdevpart1",
            "title": "Workshop: Programació web (HTML + JavaScript + jQuery), Part I",
            "desc": "En el nostre primer workshop varem fer una introducció al llenguatge de programació de moda: JavaScript. Sabies que a més JavaScript és el llenguatge de programació de la web? En aquest taller aprendrem les bases d'HTML, què és el DOM, i cóm podem interactuar amb el mateix gràcies a JavaScript. També farem una introducció a jQuery, una llibreria de JavaScript creada al 2006 que ha canviat per sempre la programació web. Vols crear la teva primera aplicació web, i veure de quines altres coses pot ser capaç amb JavaScript? No t'ho perdis!",
            "completed": true
        },
        {
            "id": "webdevpart2",
            "title": "Workshop: Programació web (HTML + JavaScript + jQuery), Part II",
            "desc": "A la primera part del taller de desenvolupament web varem aprendre les bases d'HTML i el DOM, i també varem fer una introducció a CSS i a jQuery, una llibreria de JavaScript creada al 2006 que ha canviat per a sempre la programació web. En aquesta segona part seguirem desenvolupant la nostra primera aplicació web amb jQuery, i carregarem dades dinàmicament mitjançant consultes AJAX a una API pública. No pasa res si et vas perdre la primera part del taller, també ets benvinguda! Et donarem el material necessari i estarem allí per a donar-te un cop de mà en tot moment.",
            "completed": true
        },
        {
            "id": "introtogit",
            "title": "Workshop: Introducció a Git",
            "desc": "Git és un sistema de control de versions creat per Linus Torvalds que s'utilitza per al desenvolupament de software i d'altres tasques de control de versions. Com a sistema de control de versions distribuït, està dirigit a la velocitat, integritat de les dades, i el suport als fluxes de treball distribuïts i no lineals. Permet a grups de persones treballar en els mateixos documents alhora sense trepitjar-se la feina mutuament. Avui en dia Git és una eina indispensable pels projectes col·laboratius de codi obert. En aquest taller aprendrem la filosofia de treball amb repositoris de codi, cóm funciona Git, i a utilitzar Git des de la consola de comandes.",
            "completed": true
        },
        {
            "id": "introtowp",
            "title": "Workshop: Introducció a WordPress",
            "desc": "WordPress és el sistema de gestió de continguts (CMS per les seves sigles en anglès: Content Management System) més popular i utilitzat del món. S'utilitza tant per a la creació de webs corporatives, com de webs personals o blogs. La seva popularitat radica principalment en la gran quantitat de plugins disponibles, gràcies a la seva enorme comunitat d'usuaris i desenvolupadors. Aquest taller serà una introducció a WordPress: t'acompanyarem en les teves primeres passes i et mostrarem cóm seguir pel teu compte a partir d'aquí.",
            "completed": true
        },
        {
            "id": "introtonpm",
            "title": "Workshop: Introducció a npm",
            "desc": "Node.js ha revolucionat la manera de crear aplicacions JavaScript gràcies, en gran part, a npm, el seu gestor de paquets. npm (Node Package Manager) permet consumir i distribuir mòduls JavaScript a través del seu registre, que avui dia compta amb més de 350.000 paquets. El registre de npm és una col·lecció pública de paquets de codi obert per a Node.js, aplicacions front-end, aplicacions mòbils, robots, routers, i una infinitat de necessitats de la comunitat JavaScript. En aquest taller Kat Marchán, enginyera a npm, Inc., ens ensenyarà què és npm, com utilitzar-lo, com publicar els nostres propis paquets, i com treure-li profit a les altres eines que npm proveeix.",
            "completed": true
        },
        {
            "id": "htmlgamestalk",
            "title": "Xerrada: Introducció al taller de videojocs en HTML5",
            "desc": "",
            "completed": true
        },
        {
            "id": "htmlgames",
            "title": "Workshop: Videojocs en HTML5",
            "desc": "",
            "completed": false
        }
    ]
}