{
    "title": "AdaJS",
    "menuEvents": "Eventos",
    "menuAboutUs": "Sobre nosotras",
    "menuContact": "Contacto",
    "menuCodeOfConduct": "Código de conducta",
    "introPart1": "es una comunidad de mujeres que se reúnen periódicamente en Barcelona, con el objetivo de promover y apoyar el crecimiento del sector femenino en el ámbito de las tecnologías de la información (IT) a través de <strong>JavaScript</strong> y el desarrollo web en general. Por eso nuestro carácter es eminentemente práctico y educativo.",
    "introPart2": "¿Qué hacemos? Organizamos encuentros y talleres gratuitos en los que ofrecemos a nuestras miembros formación en técnicas de desarrollo web y <strong>JavaScript</strong>.",
    "introPart3": "No existe ningún tipo de prerrequisito para entrar a formar parte de este grupo, ¡tan sólo necesitas tener ganas de participar!",
    "titleContact": "Contacta con nosotras",
    "contactText": "Si tienes algún comentario, petición o propuesta, no dudes en ponerte en contacto con nosotras en el email:",
    "aboutFounders": "Miembros fundadoras / Antiguas miembros",
    "aboutCurrent": "Miembros en activo",
    "codeOfConduct": "<p>Todos los miembros de nuestra comunidad y en especial los asistentes y ponentes a cualquiera de nuestros eventos deben aceptar el siguiente código de conducta con el objetivo de conseguir un espacio seguro y libre de situaciones inapropiadas para todos.</p><p>Las organizadoras velarán en todo momento por el cumplimiento del mismo y esperamos que entre todos podamos mantener un ambiente diverso, respetuoso, sano y agradable donde compartir conocimiento y experiencia.</p><p>Ni en nuestras reuniones organizadas para charlas y workshops, ni en nuestra comunidad se permite ningún tipo de abuso ni discriminación por motivos de género, orientación o identidad sexual, edad, procedencia, raza, religión, discapacidad, apariencia física o nivel de experiencia profesional ni ningún otro.</p><p>Algunas de las conductas que se consideran inapropiadas en cualquiera de los eventos que organizamos y en los contactos derivados de ellos en nuestra comunidad: <ul><li>Lenguaje o imágenes sexuales</li><li>Comentarios ofensivos hacia cualquier miembro de nuestra comunidad</li><li>Conductas intimidatorias</li><li>Acoso o persecución</li><li>Atención sexual no deseada</li><li>Contactos físicos inapropiados</li><li>Grabación o fotografías inadecuadas de cualquier miembro de nuestra comunidad</li><li>Publicación de información privada de terceros sin su consentimiento, como direcciones físicas o electrónicas</li><li>La interrupción sistemática en cualquiera de nuestros eventos</li></ul></p><p>Si alguien viola alguna de estas reglas u otras que sean consideradas abusivas, deberá detener su comportamiento a la primera llamada de atención y podrá ser expulsado del evento y/o de la comunidad a discreción de las organizadoras.</p><p>Las organizadoras esperamos la colaboración de todos. Si alguien se ve en alguna de estas situaciones o es testigo de que alguien está sufriendo este tipo de comportamientos, rogamos nos informéis lo antes posible para que podamos ponerle fin y tomar las medidas oportunas.</p><p>Si tienes alguna duda, o necesitas ponerte en contacto, escríbenos a <a class='email' href='mailto:barcelona@adajs.com'>barcelona@adajs.com</a></p>",
    "titleUpcoming": "Próximos eventos",
    "titleSocial": "Redes sociales",
    "titleComingSoon": "Próximamente",
    "joinMeetup": "Apúntate a nuestro",
    "titleEventDesc": "Descripción del evento",
    "events": [
        {
            "id": "ladiesjs",
            "title": "LadiesJS: Introducción a JavaScript",
            "desc": "",
            "completed": true
        },
        {
            "id": "jsforbeginners",
            "title": "Workshop: JavaScript para principiantes",
            "desc": "<p>¿Sabías que el primer programador fue una mujer? (<a href='https://es.wikipedia.org/wiki/Ada_Lovelace' href='_blank'>Ada Lovelace</a>, nuestra \"patrona\").</p><p>¿Sabías que <a href='http://www.mundiario.com/articulo/sociedad/faltan-mujeres-carreras-tecnologicas-pesar-ser-carreras-futuro/20151111134854049101.html' href='_blank'>la UE prevee que en 5 años se creen 900.000 puestos de trabajo relacionados con las TIC?</a></p><p>¿Te atraen internet y la tecnología? ¿Te gustaría saber programar pero crees que es muy difícil? ¡En absoluto! Este será un taller práctico de 3 horas en el cual te ayudaremos a aprender, por ti misma y a tu ritmo, los principios de la programación con el lenguaje de moda: JavaScript.</p>",
            "completed": true
        },
        {
            "id": "webdevpart1",
            "title": "Workshop: Programación web (HTML + JavaScript + jQuery), Parte I",
            "desc": "<p>En nuestro primer workshop hicimos una introducción al lenguaje de programación de moda: JavaScript. ¿Sabías que además JavaScript es <a href='http://tomtunguz.com/javascript/' href='_blank'>el lenguaje de programación de la web</a>?</p><p>En este taller aprenderemos las bases de HTML, qué es el DOM, y cómo podemos interactuar con el mismo gracias a JavaScript. También haremos una introducción a jQuery, una librería de JavaScript creada en 2006 que ha cambiado para siempre la programación web.</p><p>¿Quieres crear tu primera aplicación web, y ver de qué otras cosas puedes ser capaz con JavaScript? ¡No te lo pierdas!</p>",
            "completed": true
        },
        {
            "id": "webdevpart2",
            "title": "Workshop: Programación web (HTML + JavaScript + jQuery), Parte II",
            "desc": "<p>En la primera parte del taller de desarrollo web aprendimos las bases de HTML y el DOM, y también hicimos una introducción a CSS y a jQuery, una librería de JavaScript creada en 2006 que ha cambiado para siempre la programación web.</p><p>En esta segunda parte seguiremos desarrollando nuestra primera aplicación web con jQuery, y cargaremos datos dinámicamente mediante consultas AJAX a una API pública.</p><p>No pasa nada si te perdiste la primera parte del taller, ¡también eres bienvenida! Te daremos el material necesario y estaremos ahí para echarte una mano en todo momento.</p>",
            "completed": true
        },
        {
            "id": "introtogit",
            "title": "Workshop: Introducción a Git",
            "desc": "<p><a href='https://es.wikipedia.org/wiki/Git' target='_blank'>Git</a> es un sistema de control de versiones creado por Linus Torvalds que se utiliza para el desarrollo de software y otras tareas de control de versiones. Como sistema de control de versiones distribuido, está dirigido a la velocidad, integridad de los datos, y el apoyo a los flujos de trabajo distribuidos y no lineales. Permite a grupos de personas trabajar en los mismos documentos al mismo tiempo sin pisarse mutuamente.</p><p>Hoy en día Git es una herramienta indispensable para los proyectos colaborativos de código abierto. En este taller aprenderemos la filosofía de trabajo con repositorios de código, cómo funciona Git, y a utilizar Git desde la consola de comandos.</p>",
            "completed": true
        },
        {
            "id": "introtowp",
            "title": "Workshop: Introducción a WordPress",
            "desc": "<p><a href='https://es.wikipedia.org/wiki/WordPress' target='_blank'>WordPress</a> es el sistema de gestión de contenidos (CMS por sus siglas en inglés: Content Management System) más popular y utilizado del mundo. Se utiliza tanto para la creación de webs corporativas, como de webs personales o blogs. Su popularidad radica principalmente en la gran cantidad de plugins disponibles, gracias a su enorme comunidad de usuarios y desarrolladores.</p><p>Este taller será una introducción a Wordpress: te acompañaremos en tus primeros pasos y te mostraremos cómo seguir por tu cuenta a partir de ahí.</p>",
            "completed": true
        },
        {
            "id": "introtonpm",
            "title": "Workshop: Introducción a npm",
            "desc": "<p><a href='https://nodejs.org/es/' target='_blank'>Node.js</a> ha revolucionado la manera de crear aplicaciones JavaScript gracias, en gran parte, a npm, su gestor de paquetes. npm (Node Package Manager) permite consumir y distribuir módulos JavaScript a través de su registro, que hoy en día cuenta con más de 350.000 paquetes. El registro de npm es una colección pública de paquetes de código abierto para Node.js, aplicaciones frontend, aplicaciones móviles, robots, routers, y un sinfín de necesidades de la comunidad JavaScript.</p><p>En este taller Kat Marchán, ingeniera en <a href='https://www.npmjs.com' target='_blank'>npm, Inc.</a>, nos enseñará qué es npm, cómo utilizarlo, cómo publicar nuestros propios paquetes, y cómo sacarle provecho a las otras herramientas que npm provee.</p>",
            "completed": true
        },
        {
            "id": "introhtmlgames",
            "title": "Charla: Introducción al taller de videojuegos en HTML5",
            "desc": "<p>Este evento será una introducción al Taller de videojuegos en HTML5 del próximo sábado 4 de marzo, en el que Belén Albeza nos enseñará y guiará en la creación de un videojuego desde cero.</p><p>El evento constará de dos partes: en la primera, hablaremos de por qué hacer un videojuego en HTML5, herramientas para hacer videojuegos en HTML5, y conceptos básicos de programación de videojuegos 2D. En la segunda parte refrescaremos conceptos básicos de JavaScript necesarios para el taller, como new, this, funciones, arrays, etc.</p>",
            "completed": true
        },
        {
            "id": "htmlgames",
            "title": "Workshop: Videojuegos en HTML5",
            "desc": "<p>Los videojuegos HTML5 nos permiten publicar juegos en la web a los que cualquiera puede acceder y jugar sin necesidad de instalar ningún software adicional: tan sólo es necesario un navegador de internet.</p><p>Hay muchas herramientas para desarrollar juegos HTML5; una muy popular es <a href='https://phaser.io' target='_blank'>Phaser</a>, un framework JavaScript para videojuegos en 2D que cuenta con <a href='https://phaser.io/games' target='_blank'>cientos de videojuegos gratuitos publicados</a>. ¡Incluso Iron Maiden han promocionado su último álbum con un <a href='http://speedoflight.ironmaiden.com/' target='_blank'>videojuego</a> desarrollado con Phaser!</p><p>En este taller Belén Albeza nos enseñará y guiará en la creación, paso a paso, de un videojuego de plataformas, utilizando Phaser.</p>",
            "completed": true
        },
        {
            "id": "introtopython",
            "title": "Workshop: Introducción a Python",
            "desc": "<p>Si no conoces Python -<a href='https://es.wikipedia.org/wiki/Python' target='_blank'>creado en 1991 por Guido van Rossum</a>-, tal vez te sorprenderá saber que no tan sólo es <a href='http://blog.codeeval.com/codeevalblog/2016/2/2/most-popular-coding-languages-of-2016' target='_blank'>uno de los lenguajes de programación más populares hoy en día</a>, sino que <a href='http://pypl.github.io/PYPL.html' target='_blank'>su popularidad no ha dejado de crecer en los últimos años</a>.</p><p>Efectivamente, nos alejamos de JavaScript pero no demasiado, puesto que Python comparte varias características con el primero. Python es un lenguaje interpretado, multiparadigma, multiplataforma, con licencia de código abierto, y es extremadamente versátil, lo que lo convierte en la elección de muchas startups.</p><p>Este taller de introducción, que nos impartirá nuestra compañera Elena, será fundamentalmente práctico, y no requiere ningún conocimiento previo.</p>",
            "completed": true
        },
        {
            "id": "es6typescript",
            "title": "Workshop: Typescript y ES6",
            "desc": "<p><a href='https://www.typescriptlang.org/' target='_blank'>Typescript</a>, un lenguaje de programación de código abierto desarrollado y mantenido por Microsoft, es en realidad un superconjunto de ES2015/ES6 (ECMAScript 6, la versión más reciente de JavaScript), que extiende su sintaxis. Para poder ser ejecutado, Typescript debe ser transpilado a JavaScript.</p><p>Seguramente habrás oído a más de un desarrollador backend burlarse y/o menospreciar JavaScript por razones como no ser un lenguaje tipado, no ser orientado a objetos, etc.</p><p>Typescript se creó con el propósito de aportar a JavaScript características propias de lenguajes compilados como Java, C++, o C#, tales como tipado estático, orientación a objetos basada en clases, interfaces, enumeraciones, o tipos genéricos, lo que permite -entre otras cosas- una detección temprana de errores en tiempo de compilación.</p><p>En este taller, Paqui Calabria, Senior Frontend Developer en AXA Group Solutions, nos enseñará cómo Typescript nos permite desarrollar aplicaciones JavaScript con características del presente y el futuro.</p>",
            "completed": true
        },
        {
            "id": "vuejs",
            "title": "Workshop: Vue.js",
            "desc": "<p>Si estás al corriente de las últimas tendencias en desarrollo frontend habrás oído hablar de <a href='https://vuejs.org/' target='_blank'>Vue.js</a>, el framework de JavaScript progresivo.</p><p>Creado por <a href='https://twitter.com/youyuxi' target='_blank'>Evan You</a> después de trabajar para Google desarrollando AngularJS, Vue.js fue lanzando a principios de 2014 y desde entonces <a href='https://trends.google.com/trends/explore?q=vuejs' target='_blank'>su popularidad no ha dejado de crecer</a>.</p><p>Muchos desarrolladores comparan Vue.js con Angular y React y lo cierto es que reúne lo mejor de ambos: ligero, basado en componentes, poco dogmático, interfaz de usuario declarativa, <i>templates HTML</i>, depuración con <i>hot-reloading</i> y <i>time-travel</i>...</p><p>En este taller Núria Soriano, frontend developer en <a href='http://es.tviso.com/' target='_blank'>Tviso</a>, nos hará una introducción práctica al desarrollo de SPAs (<i>single-page applications</i> con Vue.js.</p>",
            "completed": true
        },
        {
            "id": "handsones6",
            "title": "Workshop: Hands on ES6",
            "desc": "<p><a href='https://www.w3schools.com/js/js_es6.asp' target='_blank'>ES6/ES2015</a> es la 6ª edición de ECMAScript, la especificación de lenguaje implementada y estandarizada por JavaScript, publicada en 2015.</p><p>ES6 trajo consigo muchos cambios significativos a JavaScript (muchos de los cuales todavía no están soportados por todos los navegadores de internet): algunos interesantes, otros prácticos, y otros geniales, tales como funciones flecha, plantillas de texto, destructuración, promesas, y muchos más.</p><p>Este será un taller totalmente práctico, basado en katas y dirigido por Paqui Calabria, Senior Frontend Developer en AXA IT.</p>",
            "completed": true
        },
        {
            "id": "cleancode",
            "title": "Workshop: Clean code",
            "desc": "<p>Todo el mundo quiere programar, y cualquiera puede programar... pero ¿puede cualquiera entender nuestro código? Cada día más y más empresas empiezan a buscar desarrolladores que sigan buenas prácticas, y escribir código limpio es una de las buenas prácticas que deberíamos seguir.</p><p><a href='https://www.pearson.com/us/higher-education/program/Martin-Clean-Code-A-Handbook-of-Agile-Software-Craftsmanship/PGM63937.html' target='_blank'><i>Clean Code</i></a>, un libro escrito por Robert C. Martin en 2008, se ha convertido en una referencia para todo programador.</p><p>Esta será una sesión dirigida por Beatriz Martín, JavaScript Technical Lead at AXA IT, en la que compartiremos, comentaremos, e intentaremos dar sentido a qué se considera código limpio, y cómo empezar a escribirlo. 'Limpiaremos' código sucio de ejemplos prácticos y nos divertiremos haciéndolo.</p><p><i>\"Be smart. Be clean. Be simple. Ship! And keep a small roll of duct tape at the ready, and don't be afraid to use it.\"</i> - Uncle Bob (Robert C. Martin)</p><p><i>\"Any fool can write code that a computer can understand. Good programmers write code that humans can understand.\"</i> - Martin Fowler</p>",
            "completed": true
        },
        {
            "id": "react",
            "title": "Workshop: React",
            "desc": "<p>Mantenida por Facebook, <a href='https://reactjs.org/' target='_blank'>React</a> es una librería de JavaScript de código abierto para crear interfaces de usuario. Su popularidad no ha dejado de crecer desde su lanzamiento en mayo de 2013, y actualmente la usan muchas grandes empresas tales como Airbnb, Atlassian, Netflix, Whatsapp, ¡o incluso Meetup! ¿Tienes curiosidad por saber más?</p><p>Este taller será una introducción a la magia de React ✨. Aprenderemos conceptos como JSX, Componentes, props, y manejo de estado, junto con buenas prácticas.</p><p>Nuestra ponente, Marta Bondyra, es Frontend Developer en Typeform y una apasionada de las nuevas tecnologías. Empezó a trabajar en tecnología como ingeniera de backend en Nokia, pero pronto descubrió que la industria de las telecomunicaciones apenas conlleva magia visual así que se pasó al frontend y ahí se ha quedado. En su tiempo libre toca el ukulele o lee libros. La puedes encontrar llevando una bufanda de Gryffindor, aunque en su corazón sabe que realmente es una Slytherin.</p>",
            "completed": true
        },
        {
            "id": "automatedtesting",
            "title": "Talk: Tests automatizados en el mundo real: Introducción y consejos",
            "desc": "<p>Los tests, en todas sus formas (pruebas unitarias, e2e, manuales...) son un requisito obligatorio para un producto de calidad. Las pruebas automatizadas pueden ahorrar horas de depuración, pero aún muchas personas se sienten perdidas cuando comienzan a hacerlo, o incluso después de meses de experiencia.</p><p>En esta charla, revisaremos los conceptos básicos de las pruebas automatizadas y hablaremos sobre la metodología y las buenas prácticas desde un punto de vista pragmático.</p>",
            "completed": true
        },
        {
            "id": "visualthinking",
            "title": "Talk: Visual Thinking para developers",
            "desc": "<p><em>'En las reuniones, invertimos más tiempo en comprender el problema que en buscar soluciones'</em></p><p><em>'Nadie lee la documentación que tenemos (vamos... ni yo leo mi propia documentación)'</em></p><p><em>'Tengo una idea clara pero es difícil de explicar'</em></p><p>'¿Alguna de estas frases te parece familiar? ¡Únete a nosotras en este encuentro! 💪 Vamos a compartir diferentes formas de aplicar Visual Thinking en el día a día, que te ayudarán en estas situaciones. No solo estamos hablando de bocetos y dibujos, ¡así que 'no sé cómo dibujar' no es una excusa! 😉</p>",
            "completed": true
        },
        {
            "id": "smartcities",
            "title": "Talk: Smart Cities",
            "desc": "<p>Las Smart Cities están surgiendo a nuestro alrededor, cada vez están más de moda, pero, ¿sabemos qué son realmente? ¿Sabemos cómo participar y colaborar en su desarrollo? ¿Qué riesgos podrían causar?</p><p>En esta charla diseccionaremos una ciudad inteligente y conoceremos a sus habitantes: los <em>homo smartiensis.</em></p>",
            "completed": false
        }
    ]
}